#include <iostream>
#include <locale>

using namespace std;

void findZone(float x, float y, int& zone) { // функция которая ничего не возвращает
    if (x * x + y * y > 4 && x > 0 && y < 0 && y < -1 && y < -x + 1) {
        zone = 1;
    } // проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x > 0 && y < 0 && y < -1 && y >= -x + 1) {
        zone = 2;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x > 0 && y < 0 && y >= -1) {
        zone = 3;
    }// проверка зоны по координатам и вывод результата
    else if (x * x + y * y > 4 && x > 0 && y >= 0 && y < x * x - 1) {
        zone = 4;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x > 0 && y >= 0 && y >= x * x - 1) {
        zone = 5;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x <= 0 && y >= 0 && y > -x + 1) {
        zone = 6;
    }// проверка зоны по координатам и вывод результата
    else if (x * x + y * y > 4 && x <= 0 && y >= 0 && y <= -x + 1 && y > x * x - 1) {
        zone = 7;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x <= 0 && y >= 0 && y <= -x + 1 && y <= x * x - 1) {
        zone = 8;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x <= 0 && y < 0 && y > -1) {
        zone = 9;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x <= 0 && y < 0 && y <= -1) {
        zone = 10;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x < 0 && y < 0 && y < -1) {
        zone =11;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x >= 0 && y < 0 && y < -1) {
        zone = 12;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x > 0 && y < 0 && y >= -1 && y < -x + 1 && y < x * x - 1) {
        zone = 13;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x > 0 && y < 0 && y >= -1 && y >= -x + 1 && y < x * x - 1) {
        zone = 14;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x > 0 && y >= 0 && y < x * x - 1) {
        zone = 15;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x > 0 && y > 0 && y >= x * x - 1) {
        zone = 16;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x <= 0 && y > 0 && y > -x + 1) {
        zone = 17;
    }// проверка зоны по координатам и вывод результата
    else if (x * x + y * y <= 4 && x <= 0 && y > 0 && y <= -x + 1 && y > x * x - 1) {
        zone = 18;
    }// проверка зоны по координатам и вывод результата
    else if (x * x + y * y <= 4 && x <= 0 && y > 0 && y <= -x + 1 && y <= x * x - 1) {
        zone = 19;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x < 0 && y <= 0 && y >= -1 && y < x * x - 1) {
        zone = 20;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x < 0 && y <= 0 && y >= -1 && y >= x * x - 1) {
        zone = 21;
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x >= 0 && y <= 0 && y >= -1 && y >= x * x - 1) {
        zone = 22;
    }// проверка зоны по координатам и вывод результата    
    else {
        cout << "Точка не попала ни в одну из зон\n";
    }//если не попалоо никуда
}

int main() {
    setlocale(LC_ALL, "RUS");
    float x, y; // иниц х у
    cout << "введите х - ";cin >> x;
    cout << "введите y - ";cin >> y;

    int zone = 0; // создаем переменную, куда функция запишет ответ
    findZone(x, y, zone); // передаем ее по ссылке

    cout << "точка попала в зону: " << zone << endl;

    system("pause");
    return 0;
}