#include <iostream>
#include <locale>

using namespace std;

int main() {
	setlocale(LC_ALL, "RUS"); // поддержка кириллицы в консоли
    float x, y; // init x,y

    cout << "Введите значение для X: "; //input x
    cin >> x;
    cout << "Введите значение для Y: "; // input y
    cin >> y;

    if (x * x + y * y > 4 && x > 0 && y < 0 && y < -1 && y < -x + 1) {
        cout << "Зона 1\n";
	} // проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x > 0 && y < 0 && y < -1 && y >= -x + 1) {
        cout << "Зона 2\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x > 0 && y < 0 && y >= -1) {
        cout << "Зона 3\n";
    }// проверка зоны по координатам и вывод результата
    else if (x * x + y * y > 4 && x > 0 && y >= 0 && y < x * x - 1) {
        cout << "Зона 4\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x > 0 && y >= 0 && y >= x * x - 1) {
        cout << "Зона 5\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x <= 0 && y >= 0 && y > -x + 1) {
        cout << "Зона 6\n";
    }// проверка зоны по координатам и вывод результата
    else if (x * x + y * y > 4 && x <= 0 && y >= 0 && y <= -x + 1 && y > x * x - 1) {
        cout << "Зона 7\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x <= 0 && y >= 0 && y <= -x + 1 && y <= x * x - 1) {
        cout << "Зона 8\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x <= 0 && y < 0 && y > -1) {
        cout << "Зона 9\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y > 4 && x <= 0 && y < 0 && y <= -1) {
        cout << "Зона 10\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x < 0 && y < 0 && y < -1) {
        cout << "Зона 11\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x >= 0 && y < 0 && y < -1) {
        cout << "Зона 12\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x > 0 && y < 0 && y >= -1 && y < -x + 1 && y < x * x - 1) {
        cout << "Зона 13\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x > 0 && y < 0 && y >= -1 && y >= -x + 1 && y < x * x - 1) {
        cout << "Зона 14\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x > 0 && y >= 0 && y < x * x - 1) {
        cout << "Зона 15\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x > 0 && y > 0 && y >= x * x - 1) {
        cout << "Зона 16\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x <= 0 && y > 0 && y > -x + 1) {
        cout << "Зона 17\n";
    }// проверка зоны по координатам и вывод результата
    else if (x == 1 && y == 0) {
        cout << "Зона 18\n";
	}// проверка зоны по координатам и вывод результата
    else if (x * x + y * y <= 4 && x <= 0 && y > 0 && y <= -x + 1 && y > x * x - 1) {
        cout<<"Зона 18\n";
    }
    else if (x * x + y * y <= 4 && x <= 0 && y > 0 && y <= -x + 1 && y <= x * x - 1) {
        cout << "Зона 19\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x < 0 && y <= 0 && y >= -1 && y < x * x - 1) {
        cout << "Зона 20\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x < 0 && y <= 0 && y >= -1 && y >= x * x - 1) {
        cout << "Зона 21\n";
    }// проверка зоны по координатам и вывод результата    
    else if (x * x + y * y <= 4 && x >= 0 && y <= 0 && y >= -1 && y >= x * x - 1) {
        cout << "Зона 22\n";
    }// проверка зоны по координатам и вывод результата    
    else {
        cout << "Точка не попала ни в одну из зон\n";
    }//если не попалоо никуда

    return 0; // return 0 так как программа успешно завершена
}